# IFC_AddObjectMapping

## Description
Adds new object mapping to the specified category.

```pascal
FUNCTION IFC_AddObjectMapping(
				objectName : STRING;
				condition  : STRING;
				category   : INTEGER) : BOOLEAN;
```

```python

def vs.IFC_AddObjectMapping(objectName, condition, category):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectName|STRING||
|condition|STRING||
|category|INTEGER||

## Version
Availability: from Vectorworks 2023.4
## Category
* IFC